МПР/src/InformationRegisters/ПрименениеСистемНалогообложения/ПрименениеСистемНалогообложения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПрименениеСистемНалогообложения</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>СистемаНалогообложения</name>
    <type>
      <types>EnumRef.ТипыСистемНалогообложенияККТ</types>
    </type>
  </resources>
  <resources>
    <name>ОсвобожденОтНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаОкончанияПатента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТоварнаяГруппа</name>
    <type>
      <types>CatalogRef.ТоварныеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачалаПатента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

МПР/src/InformationRegisters/ПрименениеСистемНалогообложения/Forms/ФормаСпискаСНООрганизации/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущаяДата = ТекущаяДатаСеанса();
	ЭлементУсловногоОформления = Список.УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветНедоступногоТекста);
	
	ОтборЭлементаУсловногоОформления = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлементаУсловногоОформления.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаНачалаПатента");
	ОтборЭлементаУсловногоОформления.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	ОтборЭлементаУсловногоОформления.ПравоеЗначение = ТекущаяДата;
	
	ОтборЭлементаУсловногоОформления = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлементаУсловногоОформления.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаОкончанияПатента");
	ОтборЭлементаУсловногоОформления.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	ОтборЭлементаУсловногоОформления.ПравоеЗначение = ТекущаяДата;
	
	ОтборЭлементаУсловногоОформления = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлементаУсловногоОформления.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СистемаНалогообложения");
	ОтборЭлементаУсловногоОформления.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлементаУсловногоОформления.ПравоеЗначение = Перечисления.ТипыСистемНалогообложенияККТ.Патент;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", 				ВыбраннаяСтрока);
	ПараметрыФормы.Вставить("ВводСНООрганизации", 	Истина);
	
	// &ЗамерПроизводительности 	
        ОценкаПроизводительностиРТКлиент.НачатьЗамер(
                 Истина, "РегистрСведений.ПрименениеСистемНалогообложения.ФормаЗаписи");		

	ОткрытьФорму("РегистрСведений.ПрименениеСистемНалогообложения.ФормаЗаписи", ПараметрыФормы, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	ТекущаяСтрока 	= Элемент.ТекущиеДанные;	
	
	ПараметрыФормы 	= Новый Структура;
	ПараметрыФормы.Вставить("ВводСНООрганизации", 	Истина);
	ПараметрыФормы.Вставить("Организация", 			ТекущаяСтрока.Организация);
	
	Если Копирование Тогда
		ПараметрыФормы.Вставить("СистемаНалогообложения", ТекущаяСтрока.СистемаНалогообложения);		
	КонецЕсли;	
	
	// &ЗамерПроизводительности 	
        ОценкаПроизводительностиРТКлиент.НачатьЗамер(
                 Истина, "РегистрСведений.ПрименениеСистемНалогообложения.ФормаЗаписи");		

	ОткрытьФорму("РегистрСведений.ПрименениеСистемНалогообложения.ФормаЗаписи", ПараметрыФормы, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	
	РазрешеноУдалять = РазрешеноУдалятьЗапись(ТекущаяСтрока.Период, ТекущаяСтрока.Организация);
	
	Если НЕ РазрешеноУдалять Тогда	
		ОбщегоНазначенияКлиент.СообщитьПользователю(
				НСтр("ru = 'Невозможно удалить запись. Должна быть хотя бы одна запись.'"));
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция РазрешеноУдалятьЗапись(Период, Организация)
		
	Возврат РегистрыСведений.ПрименениеСистемНалогообложения.РазрешеноУдалятьЗапись(Период, Организация);
		
КонецФункции

#КонецОбласти
